<template>
  <section class="art">
    <div class="container">
      <div class="art__inner">
        <div class="art__block" v-for="(item, i) in arts" :key="i">
          <div class="content">
            <p class="title">{{ item.title }}</p>
            <div class="art__description" v-html="item.description"></div>
          </div>
          <img src="" alt="" />
        </div>
      </div>
    </div>
  </section>
</template>

<script>
import { ref } from "vue";
export default {
  setup() {
    const arts = ref([
      {
        img: "",
        title: "Деятельность",
        description:
          "ТОО 'Кокшетау Энерго' — это частная региональная электросетевая компания, основанная в 2001 году на основе ОАО “КРЭК”. Она специализируется на управлении и обслуживании электрических сетей с напряжением от 0,4 до 110 кВ. <br /> Компания активно действует на территории двух областей Казахстана: Акмолинской и Северо-Казахстанской. Территория обслуживания компании охватывает 73,7 тыс. кв. километров, что включает в себя несколько административных районов и город Кокшетау. <br /> Основная деятельность компании включает в себя покупку, транспортировку, распределение и продажу электроэнергии, а также ремонт и эксплуатацию электрооборудования.",
      },
      {
        img: "",
        title: "Учебный центр",
        description:
          "ТОО 'Кокшетау Энерго' имеет учебный центр для обучения своего персонала и повышения квалификации специалистов. <br /> Центр ежегодно организует семинары и курсы для различных групп сотрудников, включая оперативный и дежурный персонал, электрослесарей, мастеров и электромонтеров. <br /> Семинары также проводятся для руководителей и инженеров предприятия. После обучения сотрудники участвуют в соревнованиях профессионального мастерства. Кроме того, предприятие финансирует обучение и выдает удостоверения для специалистов в различных областях, таких как машинисты кранов, водители опасных грузов и стропальщики. <br /> Сотрудники, получившие образование за счет компании, обязаны работать на предприятии не менее 5 лет.",
      },
    ]);

    return {
      arts,
    };
  },
};
</script>

<style></style>
