<template>
  <section class="news">
    <div class="container">
      <div class="news__inner">
        <p class="title">Новости</p>
        <div class="cards news__cards">
          <div
            class="card"
            v-for="(item, i) in news"
            :key="i"
            @click="redirect(item.id)"
          >
            <div class="img">
              <img src="@/assets/images/news.jpg" alt="" />
            </div>
            <p class="suptitle" v-if="item.date">{{ item.date }}</p>
            <div class="flex" v-if="item.title">
              <p class="title">{{ item.title }}</p>
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="24"
                height="24"
                viewBox="0 0 24 24"
                fill="none"
              >
                <path
                  d="M5 12H19M19 12L12 5M19 12L12 19"
                  stroke="black"
                  stroke-width="2"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                />
              </svg>
            </div>
            <p class="description" v-if="item.description">
              {{ item.description }}
            </p>
          </div>
        </div>
      </div>
    </div>
  </section>
</template>

<script>
import { ref } from "vue";
import { useRouter } from "vue-router";
export default {
  setup() {
    const router = useRouter();

    const news = ref([
      {
        id: 1,
        date: "20 Jan 2022",
        title: "Қымбатты энергетик - әріптестер!",
        description:
          "Энергетиктер мерекесімен құттықтауды қабыл алыңыздар! Энергетик күні - біздің кәсіби мерекеміз. Энергетика – Ел экономиканыңең маңызды саласы. Бұл сала отанымыздың экономикасының флагманы болып табылады, сондықтан әрқашан энергетика саласындағы әріптестер жоғары құрметке және жоғары қоғамдық мәртебеге ие. Бұл салада жоғары білікті мамандардың қызмет атқаратыны белгілі.",
      },
      {
        id: 1,
        date: "20 Jan 2022",
        title: "Қымбатты энергетик - әріптестер!",
        description:
          "Энергетиктер мерекесімен құттықтауды қабыл алыңыздар! Энергетик күні - біздің кәсіби мерекеміз. Энергетика – Ел экономиканыңең маңызды саласы. Бұл сала отанымыздың экономикасының флагманы болып табылады, сондықтан әрқашан энергетика саласындағы әріптестер жоғары құрметке және жоғары қоғамдық мәртебеге ие. Бұл салада жоғары білікті мамандардың қызмет атқаратыны белгілі.",
      },
      {
        id: 1,
        date: "20 Jan 2022",
        title: "Қымбатты энергетик - әріптестер!",
        description:
          "Энергетиктер мерекесімен құттықтауды қабыл алыңыздар! Энергетик күні - біздің кәсіби мерекеміз. Энергетика – Ел экономиканыңең маңызды саласы. Бұл сала отанымыздың экономикасының флагманы болып табылады, сондықтан әрқашан энергетика саласындағы әріптестер жоғары құрметке және жоғары қоғамдық мәртебеге ие. Бұл салада жоғары білікті мамандардың қызмет атқаратыны белгілі.",
      },
      {
        id: 1,
        date: "20 Jan 2022",
        title: "Қымбатты энергетик - әріптестер!",
        description:
          "Энергетиктер мерекесімен құттықтауды қабыл алыңыздар! Энергетик күні - біздің кәсіби мерекеміз. Энергетика – Ел экономиканыңең маңызды саласы. Бұл сала отанымыздың экономикасының флагманы болып табылады, сондықтан әрқашан энергетика саласындағы әріптестер жоғары құрметке және жоғары қоғамдық мәртебеге ие. Бұл салада жоғары білікті мамандардың қызмет атқаратыны белгілі.",
      },
      {
        id: 1,
        date: "20 Jan 2022",
        title: "Қымбатты энергетик - әріптестер!",
        description:
          "Энергетиктер мерекесімен құттықтауды қабыл алыңыздар! Энергетик күні - біздің кәсіби мерекеміз. Энергетика – Ел экономиканыңең маңызды саласы. Бұл сала отанымыздың экономикасының флагманы болып табылады, сондықтан әрқашан энергетика саласындағы әріптестер жоғары құрметке және жоғары қоғамдық мәртебеге ие. Бұл салада жоғары білікті мамандардың қызмет атқаратыны белгілі.",
      },
    ]);

    const redirect = (id) => {
      if (id) router.push({ path: "/news/" + id });
    };

    return {
      router,
      news,
      redirect,
    };
  },
};
</script>

<style></style>
